// export const headerSlider = [
//   '1.	نصیب ضرور ملے گا، تم کمائی کے عمدہ ذرائع اختیار کرو		رسول اللہ ﷺنے فرمایا: ’جبرائیل  نے میرے دل میں وحی کی کہ کوئی شخص اپنا رزق اور عمر پوری کیے بغیر دنیا سے نہ جائے گا، لہٰذا تم حصولِ رزق کے عمدہ ذرائع اختیار کرو اور رزق  ملنے میں تاخیر  ہونے پر اللہ کی نافرمانی  کر کے رزق  کمانے  کے بارے میں نہ سوچو ۔  یاد رکھو!  اللہ تعالیٰ کی نافرمانی سے اس کی نعمتیں حاصل نہیں کی جا سکتیں۔ ‘‘ (معجم الکبیر للطبرانی:7694، بروایت: سیدنا ابو امامہ )',
//   '2.	پرندوں کی طرح رزق پانے کا سلیقہ		رسول اللہ ﷺنے فرمایا: ’’ اگر تم اللہ تعالیٰ پر  کما حقہ توکّل کرو تو تمہیں  یوں  رزق ملے، جیسے پرندوں کو ملتا ہے ، وہ صبح خالی پیٹ گھونسلوں سے نکلتے ہیں اور شام کو  پیٹ بھر کر لوٹتے ہیں۔ ‘‘ (جامع ترمذی:2344، بروایت: سیدنا عمر بن الخطاب )',
//   '3.	طاقت پر ناز کیسا، ممکن ہے تمہارا رزق کمزوروں کی وجہ سے ہو 	رسول اللہ ﷺ کے زمانے میں دوبھائی تھے، ایک دین سیکھنے کے لیے رسول اللہ ﷺ کی خدمت میں حاضر رہتا اور دوسرا محنت مزدوری کرتا، ایک دن محنت  مزدوری کرنے والے نے اپنے بھائی کے (دین سیکھنے اور کام نہ کرنے کی) شکایت کی تو رسول اللہﷺ نے فرمایا:’’ عین ممکن ہے  کہ تجھے اسی کی وجہ سے رزق ملتا ہو۔‘‘ (جامع ترمذی:2345، بروایت: سیدنا انس )',
//   '4.	تم بُری سمجھتے ہو، حالانکہ اچھی چیزیں ہیں یہ!	رسول اللہ ﷺ نے  فرمایا: ’’ آدم  کا بیٹا دو  (اچھی) چیزوں کو ناپسند جانتا ہے ۔یہ  موت  کو ناپسند کرتا ہے، حالانکہ مؤمن کے لیے فتنے میں پڑ جانے سے موت بہتر ہے اور فرزندِ آدم  مال کی کمی سے ڈرتا ہے، حالانکہ کم مال  کا مطلب ہے کم حساب ۔‘‘  (مسند احمد،حدیث نمبر:23625، براویت: سیدنا محمود بن لبید  )',
//   '5.	موت سے بڑھ کر تعاقب میں  ہے لگی  ہوئی  چیز		رسول اللہ ﷺنے فرمایا: ’’ موت سے بھی بڑھ کر رزق انسان کی تلاش میں رہتا ہے۔‘‘ (صحیح الجامع:355، بروایت: سیدنا ابوالدرداء )',
//   '6.	ہاتھ کی کمائی سے بڑھ کر کوئی کمائی نہیں!		رسول اللہ ﷺنے فرمایا: ’’ اپنے ہاتھوں سے کمائی  ہوئی روزی سے بڑھ کر عمدہ روزی کسی نےنہیں کھائی اور اللہ کے نبی داؤد بھی اپنے ہاتھ سے کمائی  ہوئی روزی کھایا کرتے تھے۔‘‘ (صحیح بخاری:2072، بروایت : سیدنا مقدام )',
//   '7.	محنت کرو، آسمان سے سونا نہیں برستا!	سیدنا عمرفاروق  کا فرمان  ہے : ’’رزق کی تلاش میں سستی نہ برتو کہ بیٹھے بیٹھے کہنے لگو: ’’اے اللہ مجھے رزق عطا فرما!‘‘ تم بخوبی جانتے ہو کہ (رزق کا وسیلہ کوشش ہے) آسمان سے سونا اور چاندی نہیں برستے۔‘‘ (موسوعۃ الألبانی فی العقیدہ:9؍595)',
//   '8.	محنت کے لیے کوئی پیشہ عیب نہیں	رسول اللہ ﷺنے فرمایا: ’’زکریا  بڑھئی تھے۔‘‘ (صحیح مسلم:2379، بروایت: سیدنا ابوہریرہ )',
//   '9.	نبیٔ رحمت نے بھی مزدوری کی!	رسول اللہ ﷺنے فرمایا: ’’اللہ  تعالیٰ نے جو نبی بھی مبعوث فرمایا، اس نے بکریاں چرائیں۔‘‘ صحابہ  نے دریافت کیا: ’’یا رسول اللہ! کیا آپ نے بھی بکریاں چرائی ہیں؟ ‘‘ آپ ﷺنے فرمایا: ’’ہاں! چند قیراط کی مزدوری پر میں نے بھی  مکہ والوں کی بکریاں چرائیں ۔‘‘ (صحیح بخاری:2262، بروایت: سیدنا  ابوہریرہ )',
//   '10.	اجرت دینے میں دیر نہ کرو		رسول اللہ ﷺنے فرمایا: ’’ مزدور کا پسینہ خشک ہونے سے پہلے پہلے اس کی مزدوری ادا کر دو۔‘‘ (سنن ابن ماجہ:2443، بروایت: سیدنا عبداللہ بن عمر )',

//   '11.	تین باتوں پر اللہ کے رسول نے قسم کھائی	رسول اللہﷺ نے فرمایا: ’’تین باتوں پر میں اللہ کی قسم کھاتا ہوں: (1) صدقہ دینے سے آدمی کا مال   کبھی کم نہیں ہوتا۔ 	(2) اپنے اوپر ہونے والے ظلم پر اگر کوئی شخص صبر کر لے تو اللہ تعالیٰ اس کی عزت میں اضافہ فرما دیتا ہے۔	(3) جو آدمی لوگوں کے سامنے  ہاتھ پھیلانے لگے، اللہ تعالیٰ اس پر غربت کا دروازہ  کھول دیتا ہے۔‘‘  (جامع ترمذی:2325، بروایت: سیدنا ابو کبشہ انماری )',
//   '12.	سب سے بڑا عابد اور سب سے بڑا غنی بننے کے گُر 	رسول اللہ نے فرمایا:’’ حرام امور سے بچ  جاؤ ، تم سب سے بڑے عبادت گزار بن جاؤ گے،اللہ تعالیٰ کی تقسیم (عطاکردہ رزق) پر راضی ہو جاؤ تم سب سے زیادہ غنی ہوجاؤ گے ۔ جو کچھ تم اپنے لئے پسند کرتے ہو دوسروں کےلئے بھی وہی چاہو، تم اچھے مسلمان بن جاؤ گے اور زیادہ مت ہنسا کروکیونکہ زیادہ ہنسنا دل کو مردہ کر دیتا ہے۔‘‘  (جامع ترمذی :2305،بروایت سیدنا ابوہریرہ  )',
//   '13.	وہم وگمان سے بڑھ کر رزق!	رسول اللہﷺ نے فرمایا: ’’ جو شخص استغفار کرنا معمول بنا لے، اللہ تعالیٰ اسے ہر مشکل سے نکلنے کی راہ  سجھا دیتا ہے، اس کے ہر غم کا ازالہ فرما دیتا ہے  اور اسے وہاں سے رزق مہیا فرمادیتا ہے کہ جہاں سے اسے وہم و گمان بھی نہ ہو ۔‘‘ (سنن ابو داؤد: 1518، براویت: ابن عباس  )',
//   '14.	لوگوں کے خلاف خود خدا مدعی ہو گا!	رسول اللہ ﷺنے فرمایا، اللہ تعالیٰ فرماتا ہے: ’’ تین لوگوں کے خلاف، قیامت کے دن میں خود مدعی بنوں گا :  (1) جو میرے نام پر عہد کر کے وعدہ خلافی کرے ۔	(2)  جو کسی آزاد کو  بیچ کھائے۔	(3) اور جو ملازم سے کام پورا لے  کر بھی اجرت پوری نہ دے۔‘‘ (صحیح بخاری:2227، بروایت: سیدنا ابوہریرہ )',
//   '15.	دیکھنا کہیں مال وبال نہ بن جائے	رسول اللہ ﷺ نے فرمایا: ’’ مجھے اندیشہ ہے کہ میرے بعد تم پر دنیا کی فراخی اور زیب وزینت کے دروازے کھول دیئے جائیں گے۔‘‘ ایک شخص نے عرض کی:اللہ کے رسول اللہ ﷺ ! کیا اچھی چیز سے بھی برائی  کا اندیشہ ہے؟آپ کچھ دیر  خاموش رہے ۔پھر  آپ پر وحی نازل ہونے لگی۔ بعد ازاں  آپ نے چہرۂ مبارک سے پسینہ صاف کیا اور تحسینی انداز  میں  دریافت فرمایا:’’ سائل کہاں ہے؟ پھر فرمایا:’’ بات یہ ہے کہ اچھی چیز تو برائی پیدا نہیں کرتی لیکن موسمِ بہار میں گھاس  کی ایسی کثرت ہو جاتی ہے کہ   (زیادہ کھانے کی وجہ سے)  جانور کو جو  مار ڈالتی ہے یا بیمار کردیتی ہے سوائے اس سبزہ خورجانور کے کہ  جو اتنا  ہی کھائے کہ اس کی دونوں کو کھیں بھر جائیں  اور پھر  وہ دھوپ میں جا بیٹھے اور (جب ہضم کر کے) پیشاب کرلے، تو دوبارہ چرنے لگے، بلا شبہ یہ مال سر سبز اور میٹھا ہے ، یہ مال تو بس مسلمان ہی کا اچھا ساتھی ہے، وہ مسلمان کہ جو اس سے مسکینوں، یتیموں اورمسافروں  کو بھی ان کا حق دے اور فرمایا:’’ ناحق مال لینے والا اس شخص کی طرح ہے جو کھاتا جائےمگراس کا پیٹ نہ  بھرے،ایسا مال قیامت کے دن اس کے خلاف گواہی دے گا۔‘‘ (صحيح بخاری:1465، براویت: سیدنا ابو سعید خدری  )',
// ];
export const headerSlider = [
  {
    hadith: 'جس شخص نے فجر سے پہلے روزے کی نیت نہ کی، اس کا روزہ نہیں۔',
    reference: 'سنن ابو داؤد: 2454، بروایت: ام المؤمنین سیدہ حفصہ',
  },
  {
    hadith: 'سحری کھاؤ، کہ اس میں برکت ہے۔',
    reference: 'صحیح بخاری: 1923، بروایت: سیدنا انس',
  },
  {
    hadith: 'سحری کرو، خواہ ایک گھونٹ ہی سہی۔',
    reference: 'مسند احمد: 11086، بروایت: سیدنا ابوسعید',
  },
  {
    hadith: 'سحری بابرکت بھی ہے اور اک فرق بھی۔',
    reference: 'صحیح مسلم: 1096، بروایت: سیدنا عمرو بن عاص',
  },
  {
    hadith: 'عجب شخص ہے، کھاتا ہے اور رحمت پاتا ہے۔',
    reference: 'سلسلۃ صحیحہ: 3409، بروایت: سیدنا ابن عمر',
  },
  {
    hadith: 'برکت سے جو بھی ملے، لے لو۔',
    reference: 'مسند احمد: 11086، بروایت: سیدنا ابوسعید',
  },
  {
    hadith: 'کھجور، بہترین سحری۔',
    reference: 'سنن ابو داؤد: 2345، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'تین چیزیں اخلاق نبوت سے ہیں: 1- روزہ جلدی افطار کرنا (سورج غروب ہوتے ہی افطاری کرنا), 2- سحری دیر سے کرنا, 3- نماز میں دایاں ہاتھ بائیں ہاتھ کے اوپر باندھنا۔',
    reference: 'صحیح الجامع : 3038، بروایت: سیدنا ابو الدرداء',
  },
  {
    hadith:
      'سحری میں اتنی گنجائش موجود ہے: تم میں سے جب کوئی اذان ( فجر ) سنے اور برتن اس کے ہاتھ میں ہو تو اسے رکھے نہیں بلکہ اپنی ضرورت پوری کر لے۔',
    reference: 'سنن ابو داؤد : 2350، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'سحری اور فجر کی نماز میں کتنا وقفہ ہونا چاہیے؟ حضرت زید بن ثابت نے فرمایا: پچاس آیات کی تلاوت کرنے کے برابر وقفہ تھا۔',
    reference: 'صحیح بخاری : 1921',
  },
  {
    hadith:
      'ضروری غسل کیے بغیر سحری کرنا؟ ام المؤمنین سیدہ عائشہ فرماتی ہیں: میں گواہی دیتی ہوں کہ رسول اللہ ﷺ احتلام کے بغیر، جماع سے بحالتِ جنابت صبح کرتے پھر روزہ رکھتے۔',
    reference: 'صحیح بخاری : 1931',
  },
  {
    hadith:
      'یہ بھول بھی انعام ہے: روزہ دار بھول کر کھا پی لے تو وہ اپنا روزہ پورا کر لے، کیونکہ یہ اسے اللہ نے کھلایا اور پلایا ہے۔',
    reference: 'صحیح بخاری : 1933، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'روزے میں بھول کر کھا پی لیا تو کوئی کفارہ یا قضا نہیں: جو روزہ دار بھول کر روزہ افطار کرلے اس پر قضا اور کفارہ نہیں ہے۔',
    reference: 'مستدرک حاکم : 1569، بروایت: سیدنا ابو ہریرہ',
  },

  {
    hadith:
      'روزے دار کو خود بخود قے آ جائے تو اس پر قضا نہیں، جان بوجھ کر قے کر دے تو قضا دے۔',
    reference: 'سنن ابو داؤد: 2380، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'روزہ دار سرمہ لگا سکتا ہے؟ سیدہ عائشہ روایت کرتی ہیں کہ رسول اللہﷺ نے روزے کی حالت میں سرمہ لگایا۔',
    reference: 'سنن ابن ماجہ: 1678، بروایت: سیدہ عائشہ',
  },
  {
    hadith:
      'روزہ دار تیل لگا سکتا ہے سیدنا ابن مسعود بیان کرتے ہیں کہ جب کسی شخص کا روزہ ہو تو وہ صبح کو بالوں میں تیل لگا کر کنگھی کرسکتا ہے۔',
    reference: 'صحیح بخاری ، قبل حدیث: 1930 ، باب اغتسال الصائم',
  },
  {
    hadith:
      'گرمی کی شدت کم کرنے کے لیے روزہ دار کا غسل کرنا سیدنا ابوبکر بن عبدالرحمٰن ایک صحابی سے روایت کرتے ہیں کہ میں نے دیکھا، رسول اللہﷺ روزے کی حالت میں گرمی کی شدت کم کرنے کے لیے اپنے جسم پر پانی بہا رہے تھے۔',
    reference: 'سنن ابو داؤد: 2365، بروایت: سیدنا ابوبکر بن عبدالرحمن',
  },
  {
    hadith:
      'روزہ دار کے لیے وضو میں احتیاط رسول اللہﷺنے فرمایا: ’’روزے کی حالت میں وضو کے دوران ناک میں زیادہ زور سے پانی نہ چڑھاؤ۔‘‘',
    reference: 'جامع ترمذی: 788، بروایت: سیدنا لقیط بن صبرہ',
  },
  {
    hadith:
      'روزہ دار مسواک کر سکتا ہے سیدنا عامر بن ربیعہ بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو روزے کی حالت میں اتنی بار مسواک کرتے ہوئے دیکھا ہے کہ میں اسے گن یا شمار نہیں کرسکتا ۔',
    reference:
      'صحیح بخاری ، تعلیقا قبل حدیث 1934 ، باب سِوَاكِ الرَّطْبِ وَالْيَابِسِ لِلصَّائِمِ',
  },
  {
    hadith:
      'روزہ دار کسی بھی وقت مسواک کر سکتا ہے رسول اللہ ﷺ نے فرمایا: ’’اگر مجھے اپنی امت کے مشکل میں پڑ جانے کا ڈر نہ ہوتا تو میں انھیں ہر نماز کے وقت مسواک کرنےکا حکم دیتا‘‘',
    reference: 'صحیح بخاری: 887، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'صبح، دوپہر شام، بلا تفریق ہر وقت مسواک کی جا سکتی ہے سیدنا عبداللہ بن عمر فرماتے ہیں: ’’ روزہ دار دن میں صبح اور شام ( ہر وقت ) مسواک کرے اور تھوک نہ نگلے۔‘‘',
    reference: 'صحیح بخاری ، تعلیقاً قبل حدیث: 1930',
  },
  {
    hadith:
      'مسواک خشک ہو یا تر، دونوں طرح درست ہے امام ابن سیرین فرماتے ہیں: ’’ روزہ دار کے لیے تر مسواک کرنے میں کوئی حرج نہیں ہے۔‘‘',
    reference: 'صحیح بخاری ، تعلیقاً قبل حدیث: 1930',
  },
  {
    hadith:
      'جو شخص جھوٹ اور بے ہودہ بولنا اور جھوٹ پر عمل کرنا نہ چھوڑے، تو اللہ تعالیٰ کو اس کے کھانے پینے کے چھوڑ دینے کی ضرورت نہیں ہے۔',
    reference: 'سنن ابو داؤد: 2362، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'فقط کھانے پینے سے رکے رہنے کا نام روزہ نہیں رسول اللہ ﷺ نے فرمایا: ’’فقط کھانے پینے سے رکے رہنے کا نام روزہ نہیں، بلکہ بیہودہ گوئی اور شہوانی باتوں سے اجتناب کرنا بھی ضروری ہے۔‘‘',
    reference: 'صجیج الترغیب والترہیب: 1082، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'بعض روزے داروں کو روزے سے بھوک کے سوا کچھ نہیں ملتا اور بعض قیام کرنے والوں کو قیام سے بیداری کے سوا کچھ نہیں ملتا۔',
    reference: 'سنن ابن ماجہ: 1690، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'اس شخص کی ناک خاک آلود ہو جس کی زندگی میں رمضان کا مہینہ آیا اور اس کی مغفرت ہوئے بغیر وہ مہینہ گزرگیا۔',
    reference: 'جامع ترمذی: 3545، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'جب تم میں سے کوئی روزے سے ہو تو کسی قسم کی فحش بات یا جہالت کا کام نہ کرے ۔ اگر کوئی دوسرا اس سے جھگڑے یا گالی گلوچ دے تو اسے چاہیئے کہ کہہ دے میں روزے سے ہوں ، میں نے روزہ رکھا ہوا ہے ۔',
    reference: 'سنن ابو داؤد: 2363، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'وقت ہوچکا ہے روزہ افطار کریں رسول اللہ ﷺ نے فرمایا: ’’جب ادھر سے رات آجائے اور ادھر سے دن چلا جائے، نیز سورج غروب ہوجائے تو روزہ دار اپنا روزہ افطار کردے۔‘‘',
    reference: 'صحیح بخاری: 1954، بروایت: سیدنا عمر بن خطاب',
  },
  {
    hadith:
      'لوگ ہمیشہ خیر وبرکت اور نیکی پر رہیں گے جب تک وہ روز جلدی افطار کرتے رہیں گے۔',
    reference: 'صحیح بخاری: 1957، بروایت: سیدنا سہل بن سعد',
  },
  {
    hadith:
      'دین اس وقت تک غالب رہے گا جب تک لوگ افطار کرنے میں جلدی کرتے رہیں گے کیونکہ یہود و نصاریٰ تاخیر سے افطار کرتے ہیں ۔',
    reference: 'سنن ابو داؤد: 2353، بروایت: سیدنا ابو ہریرہ',
  },
  {
    hadith:
      'رسول اللہ ﷺ ایسے ہی کیا کرتے تھے ام المؤمنین سیدہ عائشہ صدیقہ سے کہا گیا ! رسول اللہ ﷺ کے اصحاب میں سے دو حضرات کا عمل کچھ اس طرح ہے کہ ان میں سے ایک افطار کرنے اور نماز ( مغرب ) پڑھنے میں جلدی کرتا ہے اور دوسرا افطار اور نماز میں ( قدرے ) تاخیر کرتا ہے۔ انہوں نے پوچھا افطار اور نماز میں جلدی کون کرتا ہے ؟ ہم نے کہا : وہ عبداللہ (بن مسعود ) ہیں ۔ انہوں نے کہا : رسول اللہ ﷺ بھی ایسے ہی کیا کرتے تھے ۔',
    reference: 'سنن ابو داؤد: 2354',
  },

  {
    topic: 'روزہ کس چیز سے افطار کیا جائے؟',
    hadith:
      'سیدنا انس بن مالک فرماتے ہیں: ’’رسول اللہ ﷺ نماز ( مغرب )  سے پہلے تازہ کھجوروں سے روزہ افطار فرماتے ‘ اگر تازہ کھجوریں نہ ہوتیں ‘ تو خشک کھجور تناول فر مالیتے ‘ یہ بھی نہ ہوتیں ‘ تو پانی کے چند گھونٹ پی لیا کرتے تھے ۔',
    reference: 'سنن ابو داؤد: 2356، بروایت: سیدنا انس بن مالک',
  },
  {
    topic: 'روزہ افطار کرنے کے وقت کی دعا',
    hadith:
      'رسول اللہ ﷺ جب روزہ افطار کرتے تو یہ دعا پڑھتے تھے (ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ الْعُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ) ” پیاس بجھ گئی ‘ رگیں تر ہو گئیں اور اﷲ نے چاہا تو اجر بھی ثابت ہو گیا ۔ “',
    reference: 'سنن ابو داؤد: 2357، بروایت: سیدنا ابن عمر',
  },
  {
    topic: 'روزہ افطار کروانے کا ثواب',
    hadith:
      'رسول اللہ ﷺ نے فرمایا: ’’جس نے روزے دار کا روزہ افطار کرایا، اسے ان( روزے داروں ) کے برابر ثواب ملے گا، لیکن ان کے ثواب میں کچھ کمی نہیں ہوگی۔‘‘',
    reference: 'سنن ابن ماجہ: 1746، بروایت: سیدنا زید بن خالد جہنی',
  },
  {
    topic: 'میزبان کو یوں دعا دیا کریں',
    hadith:
      'سیدنا انس بن مالک بیان کرتے ہیں کہ نبی کریم ﷺ جب کبھی کسی کے ہاں روزہ افطار کرتے تو یہ دعا پڑھتے ’’ أَفطَرَ عِندَكُمُ الصائِمُونَ وأَكَلَ طَعامَكُمُ الأَبرَارُ وَتَنَزَّلَت عَلَيكُمُ الملائِكَةُ ‘‘روزے دار تمہارے ہاں افطار کیا کریں ، نیک صالح لوگ تمہارا کھانا کھایا کریں اور تم پر فرشتوں کا نزول ہوتا رہے ۔‘‘',
    reference: 'صحیح الجامع الصغیر: 4677، بروایت: سیدنا انس بن مالک',
  },
  {
    topic: 'ابر آلود مطلع کے سبب قبل از وقت روزہ افطار کر بیٹھا تو ۔۔۔ ؟',
    hadith:
      'سیدہ اسماء بنت ابی بکر فرماتی ہیں کہ نبی کریم ﷺ کے عہد مبارک میں ایک دن مطلع ابر آلود تھا۔ ہم نے روزہ افطار کرلیا۔ پھر اس کے بعد سورج نکل آیا۔ ہشام سے دریافت کیا گیا: پھر لوگوں کو قضا کا حکم دیا گیا ہوگا؟انھوں نے کہا: اس کے بغیر اور کیا چارہ تھا؟',
    reference: 'صحیح بخاری: 1959',
  },
  {
    topic: 'مسافر کے لیے رخصت ہے',
    hadith:
      'سیدہ عائشہ روایت کرتی ہیں کہ رسول اللہﷺ نے حضرت حمزہ بن عمرو اسلمی کو دوران سفر روزے کے متعلق فرمایا، اگر چاہو تو روزہ رکھ لو اور اگر چاہو تو نہ رکھو۔',
    reference: 'صحیح بخاری: 1943، بروایت: سیدہ عائشہ',
  },
  {
    topic: 'مسافر کے لیے میدان کھلا ہے',
    hadith:
      'سیدنا عبد اللہ بن عباس فرماتے ہیں: ’’ رسول اللہ ﷺ نے سفر میں (کبھی) روزہ رکھا،اور (کبھی ) چھوڑ دیا۔‘‘',
    reference: 'سنن ابن ماجہ: 1661، بروایت: سیدنا عبد اللہ  بن عباس',
  },
  {
    topic: 'سفر  بھی تھا اور گرمی بھی',
    hadith:
      'سیدنا ابو درداء بیان کرتے ہیں: ’’ میں نے دیکھا کہ ہم لوگ ایک سفر میں رسول اللہ ﷺ کے ساتھ تھے،  اس دن شدید گرمی تھی حتی کہ آدمی گرمی کی شدت سے بچنے کے لیے آدمی اپنے سر پر ہاتھ رکھ لیتا تھا۔ (اس دن قافلے کے) لوگوں میں کسی کا روزہ نہیں تھا ،سوائے رسول اللہ ﷺ اور عبداللہ بن رواحہ   کے۔‘‘',
    reference: 'سنن ابن ماجہ: 1663',
  },
  {
    topic: 'سفر میں روزہ',
    hadith:
      'رسول اللہﷺ نے فرمایا: ’’ دورانِ سفر روزہ چھوڑنا اللہ کی دی ہوئی رخصت ہے، جو اسے اختیار کرے، یہ اس کے لیے بہتر ہے  تاہم اگر کوئی روزہ رکھنا چاہے، تو  اس میں بھی کوئی حرج نہیں۔‘‘',
    reference: 'صحیح مسلم: 1121، بروایت: سیدنا حمزہ بن عمرو اسلمی',
  },
  {
    topic: 'مسافر  بھی تھا اور گرمی بھی',
    hadith:
      'سیدنا ابو درداء   بیان کرتے ہیں: ’’ میں نے دیکھا کہ ہم لوگ ایک سفر میں رسول اللہ ﷺ کے ساتھ تھے،  اس دن شدید گرمی تھی حتی کہ آدمی گرمی کی شدت سے بچنے کے لیے آدمی اپنے سر پر ہاتھ رکھ لیتا تھا۔ (اس دن قافلے کے) لوگوں میں کسی کا روزہ نہیں تھا ،سوائے رسول اللہ ﷺ اور عبداللہ بن رواحہ   کے۔‘‘',
    reference: 'سنن ابن ماجہ: 1663',
  },
  {
    topic: 'مسافر میں روزہ',
    hadith:
      'رسول اللہﷺ نے فرمایا: ’’ دورانِ سفر روزہ چھوڑنا اللہ کی دی ہوئی رخصت ہے، جو اسے اختیار کرے، یہ اس کے لیے بہتر ہے  تاہم اگر کوئی روزہ رکھنا چاہے، تو  اس میں بھی کوئی حرج نہیں۔‘‘',
    reference: 'صحیح مسلم: 1121، بروایت: سیدنا حمزہ بن عمرو اسلمی',
  },
  {
    topic: 'مسافر  بھی تھا اور گرمی بھی',
    hadith:
      'سیدنا ابو درداء   بیان کرتے ہیں: ’’ میں نے دیکھا کہ ہم لوگ ایک سفر میں رسول اللہ ﷺ کے ساتھ تھے،  اس دن شدید گرمی تھی حتی کہ آدمی گرمی کی شدت سے بچنے کے لیے آدمی اپنے سر پر ہاتھ رکھ لیتا تھا۔ (اس دن قافلے کے) لوگوں میں کسی کا روزہ نہیں تھا ،سوائے رسول اللہ ﷺ اور عبداللہ بن رواحہ   کے۔‘‘',
    reference: 'سنن ابن ماجہ: 1663',
  },
  {
    topic: 'مسافر میں روزہ',
    hadith:
      'رسول اللہﷺ نے فرمایا: ’’ دورانِ سفر روزہ چھوڑنا اللہ کی دی ہوئی رخصت ہے، جو اسے اختیار کرے، یہ اس کے لیے بہتر ہے  تاہم اگر کوئی روزہ رکھنا چاہے، تو  اس میں بھی کوئی حرج نہیں۔‘‘',
    reference: 'صحیح مسلم: 1121، بروایت: سیدنا حمزہ بن عمرو اسلمی',
  },
  {
    topic: 'مسافر  بھی تھا اور گرمی بھی',
    hadith:
      'سیدنا ابو درداء   بیان کرتے ہیں: ’’ میں نے دیکھا کہ ہم لوگ ایک سفر میں رسول اللہ ﷺ کے ساتھ تھے،  اس دن شدید گرمی تھی حتی کہ آدمی گرمی کی شدت سے بچنے کے لیے آدمی اپنے سر پر ہاتھ رکھ لیتا تھا۔ (اس دن قافلے کے) لوگوں میں کسی کا روزہ نہیں تھا ،سوائے رسول اللہ ﷺ اور عبداللہ بن رواحہ   کے۔‘‘',
    reference: 'سنن ابن ماجہ: 1663',
  },
];

export const footerNav = [
  {
    name: 'SHOWS',
    nav: [
      {
        name: 'Ahkam o Masail',
        link: '/category/ahkamomasail',
      },
      {
        name: 'Subh e Watan',
        link: '/category/subhe-watan',
      },
      {
        name: 'Tafseer Ul Quran',
        link: '/category/tafseer-ul-quran',
      },
      {
        name: 'Paigham e Pakistan',
        link: '/category/paigham-e-pakistan',
      },
    ],
  },

  {
    name: 'Scholars',
    nav: [
      {
        name: 'Qari Sohaib Ahemd',
        link: '/qari-sohaib-ahemd-meer-muhammadi?id=2712',
      },
      {
        name: 'Dr Hammad Lakhvi',
        link: '/dr-hammad-lakhvi?id=220',
      },
      {
        name: 'Yousuf Siraj',
        link: '/hafiz-m-yousuf-siraj?id=1337',
      },
      {
        name: 'Abdul Malik Mujahid',
        link: '/abdul-malik-mujahid?id=2664',
      },
    ],
  },
  {
    name: 'QUICK LINKS ',
    nav: [
      {
        name: 'About Us',
        link: '/about-us',
      },

      {
        name: 'Contact',
        link: '/contact-us',
      },
      {
        name: 'TV Guide',
        link: '/program-scheduling',
      },
      {
        name: 'All Videos',
        link: '/videos',
      },
    ],
  },
  {
    name: 'TAGS',
    nav: [
      {
        name: 'Happy',
        link: '/tags/happy',
      },
      {
        name: 'Motivated',
        link: '/tags/motivated',
      },
      {
        name: 'Sad',
        link: '/tags/sad',
      },
    ],
  },
];

export const category = [
  {
    name: 'Ramadan',
    image: '/images/Ramadan.png',
  },
  {
    name: 'Islamic',
    image: '/images/Islamic.png',
  },
  {
    name: 'Sisters',
    image: '/images/Sisters.png',
  },
  {
    name: 'Quran',
    image: '/images/Quran.png',
  },
];
