export const headerSlider = [
  'اسلامی سال کے دوسرے  مہینے کا نام ’ صَفَر ‘ ہے۔',
  'مہینے کا نام ’ صَفَر ‘   کیوں پڑا؟	’صَفَر ‘ کا مطلب ہے :’’خالی‘‘۔اس مہینے کا نام ’ صَفَر ‘ اس لیے پڑا کہ اس مہینے میں سفر اور جنگوں پر روانگی کے باعث عربوں کے گھر خالی ہو جاتے تھے،  چنانچہ اسی مناسبت سے اس مہینے کا نام صفر پڑ گیا۔',
  '’ صَفَر ‘ سمیت کوئی مہینہ منحوس نہیں	واضح رہے کہ اسلامی شریعت کے مطابق صفر یا کوئی بھی مہینہ منحوس نہیں ہوتا۔ ایک مسلمان اللہ تعالیٰ پر یقین رکھتا ہے  اور  وہ صرف اللہ تعالیٰ  ہی کو نفع اور نقصان کا مالک سمجھتا ہے۔ ',
  'بدشگونی کی کوئی حقیقت نہیں، صفر منحوس نہیں	رسول اللہ  ﷺ  نے فرمایا:  ’’بیماری خود بخود متعدی نہیں ہوتی، بد شگونی کی کوئی حقیقت نہیں ہے اور  صفر کے مہینے میں کوئی نحوست  نہیں۔‘‘ (صحیح بخاری:5707، بروایت: سیدنا ابو ہریرہ  )',
  'بدشگونی سے بچنے  والے، بغیر حساب جنت میں	 رسول اللہ ﷺ نے فرمایا: ”میری امت کے ستر ہزار  لوگ حساب وکتاب کے بغیر جنت میں جائیں گے۔ یہ وہ لوگ ہوں گے جو جھاڑ پھونک نہیں کراتے اور نہ شگون لیتے ہیں بلکہ اپنے رب پرہی بھروسا کرتے ہیں۔“  (صحيح بخارى: 6472، برواىت: سیدنا عبد اللہ بن عباس )',
  'بدفالی لینے والا ہم میں سے نہیں	رسول اللہ ﷺ نے فرمایا: جس نے برا شگون لیا یا اس کے لیے برا شگون لیا گیا یا جس نے کہانت کی یا اس کے لیے کہانت کی گئی یا جس نے جادو کیا یا جس کے لیے جادو کیا گیا، وہ ہم میں سے نہیں۔“  ( سلسلۃ احادیث صحیحۃ: 2195، بروایت: سیدنا عمران بن حصین   )',
  ' اچھائی اللہ کی طرف سے، برائی اپنے برے اعمال کی وجہ سے	ارشادِ ربانی ہے:	’’ تمہیں جو اچھائی پہنچتی ہے تو وہ صرف اللہ کی طرف سے ہوتی ہے اور جو  برائی پہنچتی ہے تو  وہ تمہارے اپنے اعمال کی وجہ سے ہوتی ہے۔ ‘‘ (سورۃ النساء: 78۔ 79)',
  'نحوست نصیحت نہ ماننے میں ہے،انبیاء کا کفار کو جواب	ارشادِ ربانی ہے:	’’ بستی والوں نے اپنی طرف آنے والے نبیوں سے کہا : ’’ہم تمہیں اپنے لیے منحوس سمجھتے ہیں اگر تم باز نہ آئے تو ہم تمہیں سنگسار کرڈالیں گے اور تمہیں دردناک سزا  دیں گے ۔  چنانچہ اس کے جواب میں انبیاء  کہنے لگے : ’’تمہاری نحوست تو تمہارے اپنے ساتھ ہے۔ اگر تمہیں نصیحت کی جائے (تو کیا اسے تم نحوست سمجھتے ہو ؟ ) بلکہ تم ہو ہی حد سے گزرے ہوئے لوگ ۔‘‘ (سورۃ یس:18۔19)',
  'زمانے کو برا کہنا، اللہ تعالیٰ کو برا کہنے جیسا ہے	حدیثِ قدسی میں اللہ تعالیٰ کا فرمان ہے: ’’آدم کا بیٹا مجھے تکلیف دیتا ہے کہ جب وہ وقت (کسی بھی دن ،  مہینے اور  سال وغیرہ ) کو برا کہتا ہے، حالانکہ وقت (زمانہ) میں  خود ہوں، بادشاہت میرے ہی ہاتھ میں ہے، میں ہی دن اور رات کو بدلتا ہوں۔‘‘ (سنن ابی داؤد: 5274، بروایت: سیدنا ابو ہریرہ )'
];

export const footerNav = [
  
  {
    name: 'SHOWS',
    nav: [
      {
        name: 'Ahkam o Masail',
        link: '/category/ahkamomasail',
      },
      {
        name: 'Subh e Watan',
        link: '/category/subhe-watan',
      },
      {
        name: 'Tafseer Ul Quran',
        link: '/category/tafseer-ul-quran',
      },
      {
        name: 'Paigham e Pakistan',
        link: '/category/paigham-e-pakistan',
      },
    ],
  },

  {
    name: 'Scholars',
    nav: [
      {
        name: 'Qari Sohaib Ahemd',
        link: '/qari-sohaib-ahemd-meer-muhammadi?id=2712',
      },
      {
        name: 'Dr Hammad Lakhvi',
        link: '/dr-hammad-lakhvi?id=220',
      },
      {
        name: 'Yousuf Siraj',
        link: '/hafiz-m-yousuf-siraj?id=1337',
      },
      {
        name: 'Abdul Malik Mujahid',
        link: '/abdul-malik-mujahid?id=2664',
      },
    ],
  },
  {
    name: 'QUICK LINKS ',
    nav: [
      {
        name: 'About Us',
        link: '/about-us',
      },
     
      {
        name: 'Contact',
        link: '/contact-us',
      },
      {
        name: 'TV Guide',
        link: '/program-scheduling',
      },
      {
        name: 'All Videos',
        link: '/videos',
      },
    ],
  },
  {
    name: 'TAGS',
    nav: [
      
      {
        name: 'Happy',
        link: '/tags/happy',
      },
      {
        name: 'Motivated',
        link: '/tags/motivated',
      },
      {
        name: 'Sad',
        link: '/tags/sad',
      },
    ],
  },
];


export const category = [
  {
    name: 'Ramadan',
    image: '/images/Ramadan.png',
  },
  {
    name: 'Islamic',
    image: '/images/Islamic.png',
  },
  {
    name: 'Sisters',
    image: '/images/Sisters.png',
  },
  {
    name: 'Quran',
    image: '/images/Quran.png',
  },
];
